#!/usr/bin/env python
# coding: utf-8

# ### Prometheus "Основи програмування" (мовою Python)
# ##### Київський Політехнічний Інститут: Programming101

# #### Практичне завдання №2.1
# 
# Вхідні дані: 3 дійсних числа -- аргументи командного рядка.
# 
# Вихідні дані: результат обчислення формули
# 
# ![image.png](attachment:image.png)
# 
# Аргументи передаються в порядку, зазначеному у формулі, назви змінних можуть використовуватися будь-які.
# 
# Приклад
# Вхідні дані: 1 1 0.25
# Приклад виклику: python lab2_1.py 1 1 0.25
# Результат: 1.59576912161

# In[1]:


def test( b,c,a):
    import math
    x = 1/(a*math.sqrt(2*math.pi))* math.exp(-pow(b-c,2)/(2*pow(a,2)))
    return x
test(1, 1, 0.25)


# #### ПРАКТИЧНЕ ЗАВДАННЯ №3.1
# 0.0/2.0 бали (оцінюється)
# Вхідні дані: 3 дійсних числа a, b, c. Передаються в програму як аргументи командного рядка.
# 
# Результат роботи: рядок "triangle", якщо можуть існувати відрізки з такою довжиною та з них можна скласти трикутник, або "not triangle" -- якщо ні.
# 
# Наприклад
# 
# Вхідні дані: 10 20 30
# 
# Приклад виклику: python lab3_1.py 10 20 30
# 
# Результат: not triangle
# 
# Вхідні дані: 1 1 1
# 
# Приклад виклику: python lab3_1.py 1 1 1
# 
# Результат: triangle
# 
# Вхідні дані: 5.5 5.5 -2
# 
# Приклад виклику: python lab3_1.py 5.5 5.5 -2
# 
# Результат: not triangle

# In[3]:


def triangle( a,b,c):
    if a + b <= c or a + c <= b or b + c <= a:
        print('not triangle')
    else:
        print('triangle')
    
triangle(5.5,5.5,-2)  


# In[ ]:




